espressif/esp-idf/components/soc/esp32s31/register/soc/spi1_mem_c_reg.h
/** SPI1_MEM_C_CTRL2_REG register
 *  SPI1 control2 register.
 */
#define SPI1_MEM_C_CTRL2_REG (DR_REG_FLASH_SPI1_BASE + 0x10)
/** SPI1_MEM_C_SYNC_RESET : WT; bitpos: [31]; default: 0;
 *  The FSM will be reset.
 */
#define SPI1_MEM_C_SYNC_RESET    (BIT(31))
#define SPI1_MEM_C_SYNC_RESET_M  (SPI1_MEM_C_SYNC_RESET_V << SPI1_MEM_C_SYNC_RESET_S)
#define SPI1_MEM_C_SYNC_RESET_V  0x00000001U
#define SPI1_MEM_C_SYNC_RESET_S  31

/** SPI1_MEM_C_CLOCK_REG register
 *  SPI1 clock division control register.
 */
#define SPI1_MEM_C_CLOCK_REG (DR_REG_FLASH_SPI1_BASE + 0x14)
/** SPI1_MEM_C_CLKCNT_L : R/W; bitpos: [7:0]; default: 3;
 *  In the master mode it must be equal to SPI1_MEM_C_CLKCNT_N.
 */
#define SPI1_MEM_C_CLKCNT_L    0x000000FFU
#define SPI1_MEM_C_CLKCNT_L_M  (SPI1_MEM_C_CLKCNT_L_V << SPI1_MEM_C_CLKCNT_L_S)
#define SPI1_MEM_C_CLKCNT_L_V  0x000000FFU
#define SPI1_MEM_C_CLKCNT_L_S  0
/** SPI1_MEM_C_CLKCNT_H : R/W; bitpos: [15:8]; default: 1;
 *  In the master mode it must be floor((SPI1_MEM_C_CLKCNT_N+1)/2-1).
 */
#define SPI1_MEM_C_CLKCNT_H    0x000000FFU
#define SPI1_MEM_C_CLKCNT_H_M  (SPI1_MEM_C_CLKCNT_H_V << SPI1_MEM_C_CLKCNT_H_S)
#define SPI1_MEM_C_CLKCNT_H_V  0x000000FFU
#define SPI1_MEM_C_CLKCNT_H_S  8
/** SPI1_MEM_C_CLKCNT_N : R/W; bitpos: [23:16]; default: 3;
 *  In the master mode it is the divider of SPI1_MEM_C_clk. So SPI1_MEM_C_clk frequency is
 *  system/(SPI1_MEM_C_CLKCNT_N+1)
 */
#define SPI1_MEM_C_CLKCNT_N    0x000000FFU
#define SPI1_MEM_C_CLKCNT_N_M  (SPI1_MEM_C_CLKCNT_N_V << SPI1_MEM_C_CLKCNT_N_S)
#define SPI1_MEM_C_CLKCNT_N_V  0x000000FFU
#define SPI1_MEM_C_CLKCNT_N_S  16
/** SPI1_MEM_C_CLK_EQU_SYSCLK : R/W; bitpos: [31]; default: 0;
 *  reserved
 */
#define SPI1_MEM_C_CLK_EQU_SYSCLK    (BIT(31))
#define SPI1_MEM_C_CLK_EQU_SYSCLK_M  (SPI1_MEM_C_CLK_EQU_SYSCLK_V << SPI1_MEM_C_CLK_EQU_SYSCLK_S)
#define SPI1_MEM_C_CLK_EQU_SYSCLK_V  0x00000001U
#define SPI1_MEM_C_CLK_EQU_SYSCLK_S  31

/** SPI1_MEM_C_USER_REG register
 *  SPI1 user register.
 */
#define SPI1_MEM_C_USER_REG (DR_REG_FLASH_SPI1_BASE + 0x18)
/** SPI1_MEM_C_CK_OUT_EDGE : R/W; bitpos: [9]; default: 0;
 *  the bit combined with SPI1_MEM_C_mosi_delay_mode bits to set mosi signal delay mode.
 */
#define SPI1_MEM_C_CK_OUT_EDGE    (BIT(9))
#define SPI1_MEM_C_CK_OUT_EDGE_M  (SPI1_MEM_C_CK_OUT_EDGE_V << SPI1_MEM_C_CK_OUT_EDGE_S)
#define SPI1_MEM_C_CK_OUT_EDGE_V  0x00000001U
#define SPI1_MEM_C_CK_OUT_EDGE_S  9
/** SPI1_MEM_C_FWRITE_DUAL : R/W; bitpos: [12]; default: 0;
 *  In the write operations read-data phase apply 2 signals
 */
#define SPI1_MEM_C_FWRITE_DUAL    (BIT(12))
#define SPI1_MEM_C_FWRITE_DUAL_M  (SPI1_MEM_C_FWRITE_DUAL_V << SPI1_MEM_C_FWRITE_DUAL_S)
#define SPI1_MEM_C_FWRITE_DUAL_V  0x00000001U
#define SPI1_MEM_C_FWRITE_DUAL_S  12
/** SPI1_MEM_C_FWRITE_QUAD : R/W; bitpos: [13]; default: 0;
 *  In the write operations read-data phase apply 4 signals
 */
#define SPI1_MEM_C_FWRITE_QUAD    (BIT(13))
#define SPI1_MEM_C_FWRITE_QUAD_M  (SPI1_MEM_C_FWRITE_QUAD_V << SPI1_MEM_C_FWRITE_QUAD_S)
#define SPI1_MEM_C_FWRITE_QUAD_V  0x00000001U
#define SPI1_MEM_C_FWRITE_QUAD_S  13
/** SPI1_MEM_C_FWRITE_DIO : R/W; bitpos: [14]; default: 0;
 *  In the write operations address phase and read-data phase apply 2 signals.
 */
#define SPI1_MEM_C_FWRITE_DIO    (BIT(14))
#define SPI1_MEM_C_FWRITE_DIO_M  (SPI1_MEM_C_FWRITE_DIO_V << SPI1_MEM_C_FWRITE_DIO_S)
#define SPI1_MEM_C_FWRITE_DIO_V  0x00000001U
#define SPI1_MEM_C_FWRITE_DIO_S  14
/** SPI1_MEM_C_FWRITE_QIO : R/W; bitpos: [15]; default: 0;
 *  In the write operations address phase and read-data phase apply 4 signals.
 */
#define SPI1_MEM_C_FWRITE_QIO    (BIT(15))
#define SPI1_MEM_C_FWRITE_QIO_M  (SPI1_MEM_C_FWRITE_QIO_V << SPI1_MEM_C_FWRITE_QIO_S)
#define SPI1_MEM_C_FWRITE_QIO_V  0x00000001U
#define SPI1_MEM_C_FWRITE_QIO_S  15
/** SPI1_MEM_C_USR_MISO_HIGHPART : HRO; bitpos: [24]; default: 0;
 *  read-data phase only access to high-part of the buffer SPI1_MEM_C_w8~SPI1_MEM_C_w15. 1:
 *  enable 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI1_MEM_C_USR_MISO_HIGHPART    (BIT(24))
#define SPI1_MEM_C_USR_MISO_HIGHPART_M  (SPI1_MEM_C_USR_MISO_HIGHPART_V << SPI1_MEM_C_USR_MISO_HIGHPART_S)
#define SPI1_MEM_C_USR_MISO_HIGHPART_V  0x00000001U
#define SPI1_MEM_C_USR_MISO_HIGHPART_S  24
/** SPI1_MEM_C_USR_MOSI_HIGHPART : HRO; bitpos: [25]; default: 0;
 *  write-data phase only access to high-part of the buffer SPI1_MEM_C_w8~SPI1_MEM_C_w15. 1:
 *  enable 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI1_MEM_C_USR_MOSI_HIGHPART    (BIT(25))
#define SPI1_MEM_C_USR_MOSI_HIGHPART_M  (SPI1_MEM_C_USR_MOSI_HIGHPART_V << SPI1_MEM_C_USR_MOSI_HIGHPART_S)
#define SPI1_MEM_C_USR_MOSI_HIGHPART_V  0x00000001U
#define SPI1_MEM_C_USR_MOSI_HIGHPART_S  25
/** SPI1_MEM_C_USR_DUMMY_IDLE : R/W; bitpos: [26]; default: 0;
 *  SPI clock is disable in dummy phase when the bit is enable.
 */
#define SPI1_MEM_C_USR_DUMMY_IDLE    (BIT(26))
#define SPI1_MEM_C_USR_DUMMY_IDLE_M  (SPI1_MEM_C_USR_DUMMY_IDLE_V << SPI1_MEM_C_USR_DUMMY_IDLE_S)
#define SPI1_MEM_C_USR_DUMMY_IDLE_V  0x00000001U
#define SPI1_MEM_C_USR_DUMMY_IDLE_S  26
/** SPI1_MEM_C_USR_MOSI : R/W; bitpos: [27]; default: 0;
 *  This bit enable the write-data phase of an operation.
 */
#define SPI1_MEM_C_USR_MOSI    (BIT(27))
#define SPI1_MEM_C_USR_MOSI_M  (SPI1_MEM_C_USR_MOSI_V << SPI1_MEM_C_USR_MOSI_S)
#define SPI1_MEM_C_USR_MOSI_V  0x00000001U
#define SPI1_MEM_C_USR_MOSI_S  27
/** SPI1_MEM_C_USR_MISO : R/W; bitpos: [28]; default: 0;
 *  This bit enable the read-data phase of an operation.
 */
#define SPI1_MEM_C_USR_MISO    (BIT(28))
#define SPI1_MEM_C_USR_MISO_M  (SPI1_MEM_C_USR_MISO_V << SPI1_MEM_C_USR_MISO_S)
#define SPI1_MEM_C_USR_MISO_V  0x00000001U
#define SPI1_MEM_C_USR_MISO_S  28
/** SPI1_MEM_C_USR_DUMMY : R/W; bitpos: [29]; default: 0;
 *  This bit enable the dummy phase of an operation.
 */
#define SPI1_MEM_C_USR_DUMMY    (BIT(29))
#define SPI1_MEM_C_USR_DUMMY_M  (SPI1_MEM_C_USR_DUMMY_V << SPI1_MEM_C_USR_DUMMY_S)
#define SPI1_MEM_C_USR_DUMMY_V  0x00000001U
#define SPI1_MEM_C_USR_DUMMY_S  29
/** SPI1_MEM_C_USR_ADDR : R/W; bitpos: [30]; default: 0;
 *  This bit enable the address phase of an operation.
 */
#define SPI1_MEM_C_USR_ADDR    (BIT(30))
#define SPI1_MEM_C_USR_ADDR_M  (SPI1_MEM_C_USR_ADDR_V << SPI1_MEM_C_USR_ADDR_S)
#define SPI1_MEM_C_USR_ADDR_V  0x00000001U
#define SPI1_MEM_C_USR_ADDR_S  30
/** SPI1_MEM_C_USR_COMMAND : R/W; bitpos: [31]; default: 1;
 *  This bit enable the command phase of an operation.
 */
#define SPI1_MEM_C_USR_COMMAND    (BIT(31))
#define SPI1_MEM_C_USR_COMMAND_M  (SPI1_MEM_C_USR_COMMAND_V << SPI1_MEM_C_USR_COMMAND_S)
#define SPI1_MEM_C_USR_COMMAND_V  0x00000001U
#define SPI1_MEM_C_USR_COMMAND_S  31

